balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF25K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01010000" edc:name="MSEL0" edc:nzwidth="0x8" edc:por="01010000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL0" edc:desc="" edc:mask="0x3" edc:name="FIL0" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL1" edc:desc="" edc:mask="0x3" edc:name="FIL1" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL2" edc:desc="" edc:mask="0x3" edc:name="FIL2" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL3" edc:desc="" edc:mask="0x3" edc:name="FIL3" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIL0_0" edc:desc="" edc:mask="0x1" edc:name="FIL0_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL0_1" edc:desc="" edc:mask="0x1" edc:name="FIL0_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL1_0" edc:desc="" edc:mask="0x1" edc:name="FIL1_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL1_1" edc:desc="" edc:mask="0x1" edc:name="FIL1_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL2_0" edc:desc="" edc:mask="0x1" edc:name="FIL2_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL2_1" edc:desc="" edc:mask="0x1" edc:name="FIL2_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL3_0" edc:desc="" edc:mask="0x1" edc:name="FIL3_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL3_1" edc:desc="" edc:mask="0x1" edc:name="FIL3_1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL4" edc:desc="" edc:mask="0x3" edc:name="FIL4" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL5" edc:desc="" edc:mask="0x3" edc:name="FIL5" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL6" edc:desc="" edc:mask="0x3" edc:name="FIL6" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL7" edc:desc="" edc:mask="0x3" edc:name="FIL7" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIL4_0" edc:desc="" edc:mask="0x1" edc:name="FIL4_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL4_1" edc:desc="" edc:mask="0x1" edc:name="FIL4_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL5_0" edc:desc="" edc:mask="0x1" edc:name="FIL5_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL5_1" edc:desc="" edc:mask="0x1" edc:name="FIL5_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL6_0" edc:desc="" edc:mask="0x1" edc:name="FIL6_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL6_1" edc:desc="" edc:mask="0x1" edc:name="FIL6_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL7_0" edc:desc="" edc:mask="0x1" edc:name="FIL7_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL7_1" edc:desc="" edc:mask="0x1" edc:name="FIL7_1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL8" edc:desc="" edc:mask="0x3" edc:name="FIL8" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL9" edc:desc="" edc:mask="0x3" edc:name="FIL9" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL10" edc:desc="" edc:mask="0x3" edc:name="FIL10" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL11" edc:desc="" edc:mask="0x3" edc:name="FIL11" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIL8_0" edc:desc="" edc:mask="0x1" edc:name="FIL8_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL8_1" edc:desc="" edc:mask="0x1" edc:name="FIL8_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL9_0" edc:desc="" edc:mask="0x1" edc:name="FIL9_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL9_1" edc:desc="" edc:mask="0x1" edc:name="FIL9_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL10_0" edc:desc="" edc:mask="0x1" edc:name="FIL10_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL10_1" edc:desc="" edc:mask="0x1" edc:name="FIL10_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL11_0" edc:desc="" edc:mask="0x1" edc:name="FIL11_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL11_1" edc:desc="" edc:mask="0x1" edc:name="FIL11_1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL3" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL12" edc:desc="" edc:mask="0x3" edc:name="FIL12" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL13" edc:desc="" edc:mask="0x3" edc:name="FIL13" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL14" edc:desc="" edc:mask="0x3" edc:name="FIL14" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FIL15" edc:desc="" edc:mask="0x3" edc:name="FIL15" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIL12_0" edc:desc="" edc:mask="0x1" edc:name="FIL12_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL12_1" edc:desc="" edc:mask="0x1" edc:name="FIL12_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL13_0" edc:desc="" edc:mask="0x1" edc:name="FIL13_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL13_1" edc:desc="" edc:mask="0x1" edc:name="FIL13_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL14_0" edc:desc="" edc:mask="0x1" edc:name="FIL14_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL14_1" edc:desc="" edc:mask="0x1" edc:name="FIL14_1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL15_0" edc:desc="" edc:mask="0x1" edc:name="FIL15_0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIL15_1" edc:desc="" edc:mask="0x1" edc:name="FIL15_1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
