balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF25K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D1" edc:desc="" edc:mask="0xff" edc:name="B2D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D10" edc:desc="" edc:mask="0x1" edc:name="B2D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D11" edc:desc="" edc:mask="0x1" edc:name="B2D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D12" edc:desc="" edc:mask="0x1" edc:name="B2D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D13" edc:desc="" edc:mask="0x1" edc:name="B2D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D14" edc:desc="" edc:mask="0x1" edc:name="B2D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D15" edc:desc="" edc:mask="0x1" edc:name="B2D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D16" edc:desc="" edc:mask="0x1" edc:name="B2D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D17" edc:desc="" edc:mask="0x1" edc:name="B2D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D2" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D2" edc:desc="" edc:mask="0xff" edc:name="B2D2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D20" edc:desc="" edc:mask="0x1" edc:name="B2D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D21" edc:desc="" edc:mask="0x1" edc:name="B2D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D22" edc:desc="" edc:mask="0x1" edc:name="B2D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D23" edc:desc="" edc:mask="0x1" edc:name="B2D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D24" edc:desc="" edc:mask="0x1" edc:name="B2D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D25" edc:desc="" edc:mask="0x1" edc:name="B2D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D26" edc:desc="" edc:mask="0x1" edc:name="B2D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D27" edc:desc="" edc:mask="0x1" edc:name="B2D27" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D3" edc:desc="" edc:mask="0xff" edc:name="B2D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D30" edc:desc="" edc:mask="0x1" edc:name="B2D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D31" edc:desc="" edc:mask="0x1" edc:name="B2D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D32" edc:desc="" edc:mask="0x1" edc:name="B2D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D33" edc:desc="" edc:mask="0x1" edc:name="B2D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D34" edc:desc="" edc:mask="0x1" edc:name="B2D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D35" edc:desc="" edc:mask="0x1" edc:name="B2D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D36" edc:desc="" edc:mask="0x1" edc:name="B2D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D37" edc:desc="" edc:mask="0x1" edc:name="B2D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D4" edc:desc="" edc:mask="0xff" edc:name="B2D4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D40" edc:desc="" edc:mask="0x1" edc:name="B2D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D41" edc:desc="" edc:mask="0x1" edc:name="B2D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D42" edc:desc="" edc:mask="0x1" edc:name="B2D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D43" edc:desc="" edc:mask="0x1" edc:name="B2D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D44" edc:desc="" edc:mask="0x1" edc:name="B2D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D45" edc:desc="" edc:mask="0x1" edc:name="B2D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D46" edc:desc="" edc:mask="0x1" edc:name="B2D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D47" edc:desc="" edc:mask="0x1" edc:name="B2D47" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D5" edc:desc="" edc:mask="0xff" edc:name="B2D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D50" edc:desc="" edc:mask="0x1" edc:name="B2D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D51" edc:desc="" edc:mask="0x1" edc:name="B2D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D52" edc:desc="" edc:mask="0x1" edc:name="B2D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D53" edc:desc="" edc:mask="0x1" edc:name="B2D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D54" edc:desc="" edc:mask="0x1" edc:name="B2D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D55" edc:desc="" edc:mask="0x1" edc:name="B2D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D56" edc:desc="" edc:mask="0x1" edc:name="B2D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D57" edc:desc="" edc:mask="0x1" edc:name="B2D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B2D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B2D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B2D6" edc:desc="" edc:mask="0xff" edc:name="B2D6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="B2D60" edc:desc="" edc:mask="0x1" edc:name="B2D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D61" edc:desc="" edc:mask="0x1" edc:name="B2D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D62" edc:desc="" edc:mask="0x1" edc:name="B2D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D63" edc:desc="" edc:mask="0x1" edc:name="B2D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D64" edc:desc="" edc:mask="0x1" edc:name="B2D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D65" edc:desc="" edc:mask="0x1" edc:name="B2D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D66" edc:desc="" edc:mask="0x1" edc:name="B2D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B2D67" edc:desc="" edc:mask="0x1" edc:name="B2D67" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
