balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF25K80.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D7" edc:desc="" edc:mask="0xff" edc:name="TXB0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO1" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EICODE3" edc:desc="" edc:mask="0x1" edc:name="EICODE3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnsnnnr" edc:cname="CANCON_RO1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANCON_RO1" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0/FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1/FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2/FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="FP0" edc:desc="" edc:mask="0x1" edc:name="FP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN0_FP1" edc:desc="" edc:mask="0x1" edc:name="WIN0_FP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN1_FP2" edc:desc="" edc:mask="0x1" edc:name="WIN1_FP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WIN2_FP3" edc:desc="" edc:mask="0x1" edc:name="WIN2_FP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WIN0" edc:desc="" edc:mask="0x1" edc:name="WIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN1" edc:desc="" edc:mask="0x1" edc:name="WIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WIN2" edc:desc="" edc:mask="0x1" edc:name="WIN2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FP1" edc:desc="" edc:mask="0x1" edc:name="FP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP2" edc:desc="" edc:mask="0x1" edc:name="FP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FP3" edc:desc="" edc:mask="0x1" edc:name="FP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="cnnrrnrr" edc:cname="RXB1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXB1CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO_FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM0_RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXM0/RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0xff" edc:name="SID" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
